package module_3_5.task_1;

/*
Реализуйте метод, выполняющий численное интегрирование заданной функции на заданном интервале по формуле левых прямоугольников.

Функция задана объектом, реализующим интерфейс java.util.function.DoubleUnaryOperator. Его метод applyAsDouble() принимает значение аргумента
и возвращает значение функции в заданной точке.

Интервал интегрирования задается его конечными точками 𝑎 и 𝑏, причем 𝑎<=𝑏. Для получения достаточно точного результата используйте шаг сетки не больше 10−6.

Пример. Вызов

integrate(x -> 1, 0, 10)
должен возвращать значение 10.

P.S. Если задача слишком легкая, то дополнительно можете реализовать динамический выбор шага сетки по следующему алгоритму:

Вычислить приближенное значение интеграла функции при начальном значении шага сетки (например, 1).
Вычислить приближенное значение интеграла функции при более мелком шаге сетки (например, уменьшить шаг сетки в два раза).
Если разность двух последовательных приближений интеграла функции достаточно мала, то завершаем алгоритм и возвращаем текущее приближение в качестве результата.
Иначе возвращаемся к шагу 2.
*/

import java.util.function.DoubleUnaryOperator;

public class Main {

    public static double integrate(DoubleUnaryOperator f, double a, double b) {

        double nextStep = 1e-6;
        double height = 0;

        for (double x = a; x < b; x += nextStep) {
            height += f.applyAsDouble(x);
        }

        double result = height * nextStep;

        return result;
    }


}
